import {
  me,
  xmini,
  xPage,
} from '../../config/xmini';
import {
  mixins,
} from '/utils';

xPage({
  ...mixins,
  data: {
    imageSrc: "https://img1.haoshiqi.net/miniapp/zl/help_rule_238c1b9c0f.png",
    descTitle : '特别说明:',
    descs: ['1. 邀请新用户（未在好食期下单用户）助力，达到助力人数即可享免单权利；',
    '2. 每个新用户可助力一次，同一设备、微信号、QQ号、支付宝账号视为同一用户；',
    '3. 若发现用户存在刷单、虚假用户助力等违规行为，平台有权利判定助力失败；',
    '4. 邀请助力成功后并再次下单抢购商品，抢购成功后商家会安排发货，可在个人中心-我的订单中查询发货与物流详情；',
    '5. 活动有效期内，发起任务后若12小时内没有助力成功并下单，则该次助力失败；',
    '6. 所有参与并获得好友助力者，在活动结束后未获得活动商品，将补偿一张好食期平台优惠券（请通过：支付宝-朋友-服务提醒-查看好食期消息）；',
    '7. 活动商品数量有限，先到先得，暂不支持其他优惠及优惠券叠加使用；',
    '8. 平台暂不支持修改收货地址，如对物流、商品有疑问可直接联系好食期在线平台客服；',
    '9. 本次活动最终解释权归好食期所有。']
  },
  onLoad(query) {

    this.onPageInit(query);

  },
  onShow() {

  },

  onUnload() {


  },
});
